-- Заполнение таблицы Звания
INSERT INTO `Rank` (Name) VALUES
('Майор'),
('Капитан'),
('Подполковник'),
('Полковник'),
('Рядовой'),
('Ефрейтор'),
('Сержант'),
('Младший сержант'),
('Старший сержант'),
('Старшина');

-- Заполнение таблицы Офицеры
INSERT INTO Officer (Name, RankID, Date_of_Commission) VALUES
('Иванов И.И.', 1, '2023-01-01'),
('Петров П.П.', 2, '2022-05-15'),
('Сидоров С.С.', 3, '2024-03-10'),
('Козлов К.К.', 4, '2023-09-20'),
('Смирнов С.С.', 5, '2022-12-05'),
('Морозов М.М.', 3, '2023-07-18'),
('Николаев Н.Н.', 2, '2024-02-28');

-- Заполнение таблицы Виды вооружений
INSERT INTO WeaponryType (Name) VALUES
('Автомат'),
('Пистолет'),
('Пулемет'),
('Гранатомет');

-- Заполнение таблицы Вооружение
INSERT INTO Weaponry (WeaponryTypeID, Model) VALUES
(1, 'AK-47'),
(2, 'ПМ'),
(3, 'ПКМ'),
(4, 'РПГ-7');

INSERT INTO Army (Name, CommanderID) VALUES ('Первая армия', 1);

-- Заполнение таблицы Локации
INSERT INTO Location (Name) VALUES
('База 1'),
('База 2'),
('Полигон 1'),
('Полигон 2'),
('Тренировочное поле');

-- Заполнение таблицы Дивизия
INSERT INTO Division (Name, CommanderID, ArmyID, LocationID) VALUES
('Первая дивизия', 2, 1, 1),
('Вторая дивизия', 3, 1, 2);

-- Заполнение таблицы Части
INSERT INTO Unit (Name, CommanderID) VALUES
('1-я часть', 4),
('2-я часть', 5),
('3-я часть', 6),
('4-я часть', 7);

INSERT INTO WeaponryInUnit (UnitID, WeaponryID, Quantity) VALUES
(1, 1, 20),
(2, 2, 15),
(3, 3, 10),
(4, 4, 5);

-- Заполнение таблицы Рядовые
INSERT INTO Soldier (Name, RankID, UnitID) VALUES
('Смирнов Алексей Иванович', 5, 1),
('Кузнецов Дмитрий Александрович', 6, 1),
('Иванов Андрей Петрович', 7, 1),
('Соколов Сергей Алексеевич', 8, 1),
('Попов Александр Владимирович', 9, 2),
('Алексеев Денис Васильевич', 10, 2),
('Лебедев Артем Викторович', 5, 2),
('Семенов Владимир Андреевич', 6, 2),
('Егоров Максим Александрович', 7, 3),
('Павлов Илья Алексеевич', 8, 3),
('Козлов Владислав Дмитриевич', 9, 3),
('Новиков Никита Михайлович', 10, 3),
('Морозов Артем Евгеньевич', 5, 4),
('Волков Даниил Андреевич', 6, 4),
('Александров Алексей Дмитриевич', 7, 4),
('Смирнов Артем Сергеевич', 8, 4),
('Марков Артем Владимирович', 9, 4),
('Андреев Илья Викторович', 10, 4),
('Попов Артем Николаевич', 5, 4),
('Сорокин Артем Сергеевич', 6, 4);

INSERT INTO MilitarySpecialties (Name) VALUES
('Снайпер'),
('Медик'),
('Инженер'),
('Штурман'),
('Моторист');

INSERT INTO OfficerSpecialties (OfficerID, SpecialityID) VALUES
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5),
(6, 1),
(7, 2);

INSERT INTO SoldierSpecialties (SoldierID, SpecialityID) VALUES
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5),
(6, 1),
(7, 2),
(8, 3),
(9, 4),
(10, 5),
(11, 1),
(12, 2),
(13, 3),
(14, 4),
(15, 5),
(16, 1),
(17, 2),
(18, 3),
(19, 4),
(20, 5);